# SetCompoundStructure Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjAttributes..::..SetCompoundStructure Method
HostObjAttributes Class See Also
---
Sets the compound structure of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetCompoundStructure(
	CompoundStructure compoundStructure
)
```

Visual Basic
---
```text
Public Sub SetCompoundStructure ( _
	compoundStructure As CompoundStructure _
)
```

Visual C++
---
```text
public:
void SetCompoundStructure(
	CompoundStructure^ compoundStructure
)
```

# ### Parameters
compoundStructure
    Type: Autodesk.Revit.DB..::..CompoundStructure
# See Also
HostObjAttributes Class
Autodesk.Revit.DB Namespace